'''
1. 이터레이터

(1) 반복적으로 하나하나 꺼내어 처리 가능한 컬렉션이나 sequence 들을 이터레이터 객체라고한다.

(2) 이터레이터는 next()함수를 구현한 객체로, 
    next()함수는 순환 가능한 객체의 다음 원소를 반환한다.

(3) 파이썬의 이터레이터형
    : list, dict, set, bytes, tuple, range,

(4) 반복문 vs 이터레이터
반복문은 실행과 동시에 처음부터 끝까지 값을 만들어내며 메모리를 차지함
이터레이터는 값을 차례대로 꺼낼 수 있는 순회 가능한 객체를 생성한 상태로 대기했다가 
값이 필요한 시점에서 순차적으로 next 매직 매서드를 통해 값을 만들 수 있기 때문에 
메모리 효율성이 좋음
데이터 생성을 뒤로 미루는 이러한 방식을 지연 평가(lazyevaluation)라 함
terable한 객체를 iterator한 객체로 반환시키는 것이 iter 함수
이에 iterable한 객체가 iterator가 되기 전에는 next함수를 사용할 수 없음
즉, iterable한 리스트나 딕셔너리가 for문에 들어가면 iterator로 사용할 수 있는 것

'''